{
  "trader_john_entry": {
    "name": "{$trader_john_known>=2: John, local tradesman | A kind looking tradesman}",
    "image_code": "trader_john",
    "text": "He looks at you with kind eyes, sheltered by small, round glasses perched on a pointy nose. His thin lips are stretched in a kind smile, and scruffy red sideburns flank his narrow face. \n\n{ $trader_john_known>=5 : He immediately takes up a jovial posture as you approach. \"{$player_name}, it has been too long. How are you? Is there anything you would like?\"\n|\n$trader_john_known>=2 :\n\"Ah, it's you again {$player_first_name}. Happy to help if you need anything\" he says with a convivial smile across his face.\n|\n\"Hello there, just tell me if there is anything you need\" he chirps up with a resonant, nasally voice, almost as a catchphrase.\n}",
    "location": "village",
    "options": [
      {
        "id": "trader_john_entry_talk",
        "name": "Make small talk",
        "image_code": "trader_john_img",
        "short": "He seems like the kind to not mind a little conversation.",
        "meta": "Options here allow you to develop a relationship with the trader",
        "pass_redirect": "trader_john_convo",
        "properties": "instant_redirect"
      },
      {
        "id": "trader_john_entry_wares",
        "name": "Look at wares",
        "image_code": "goods",
        "short": "The place is a mess, but there is plenty on display here",
        "pass_redirect": "trader_john_wares",
        "properties": "instant_redirect"
      }
    ]
  },
  "trader_john_convo": {
    "name": "Small talk with {$trader_john_known>=2: John | the trader }",
    "image_code": "trader_john",
    "text": "What will you talk about?",
    "metatext": "Options here will continue to unlock as you get to know the trader more. Some are randomised based on the time of day or recent events. Check in at different points to see different options.",
    "return": "trader_john_entry",
    "options": [
      {
        "id": "trader_john_convo_intro",
        "name": "Make Introductions",
        "image_code": "trader_john_img",
        "short": "You have no idea what this man is even called, best introduce yourself",
        "visible_if": "$trader_john_known<2",
        "pass_long": "\"Happy to make your acquaintance {$player_first_name}, my name is John\" he introduces himself with a manner of decorum, though never dropping his smile.\n\nA thought seems to occur to him for a brief moment, as he takes a small notebook perched on the side of the counter and writes down a brief note in the least legible handwriting you have seen in some time. \n\n\"Should you be in need of anything,\" he continues as he looks back up at you \"I cannot assure you I have it. But if I do, and occasionally I will, I hope you will be among my beloved customers.\"",
        "pass_redirect": "trader_john_convo",
        "pass_quality_change": "{$trader_john_known<2 : $trader_john_known=2}"
      },
      {
        "id": "trader_john_convo_sharegossip",
        "name": "Share your gossip with John",
        "image_code": "gossip",
        "short": "You know John likes a good bit of gossip. Keeps him \"in the know\", he says",
        "visible_if": "$trader_john_known>=3",
        "unlock_if": "$trader_john_time > 1",
        "random": "{ $charm > 0 : $charm + $fellowship >= 50 [50] | $charm >= 50 [50] }",
        "pass_long": "You share the gossip you {$gossip.source}. John's eyebrows perk up. He seems _very_ interested in everything you are telling him, and with every secret that passes your lips, it feels almost like the merchant is mentally salivating.\n\n\"This is delightful, {$player_first_name}, absolutely scandalous\" he beams with unfiltered enthusiasm before taking a moment to adjust his glasses and straightening his stance for propriety. \"Best not share this anywhere else, hm?\"",
        "fail_long": "Though John seems initially interested in the gossip you {$gossip.source}, it doesn't hold his interest for long. He is clearly not the target audience, and is kind enough to cut you off before you even get into the salacious details.",
        "pass_redirect": "trader_john_convo",
        "fail_redirect": "trader_john_convo",
        "pass_quality_change": "$gossip -= 50, $trader_john_time--, $trader_john_affordance += 3, $trader_john_known++",
        "fail_quality_change": "$trader_john_time--"
      },
      {
        "id": "trader_john_convo_pryrumor",
        "name": "Pry some rumors from John",
        "image_code": "rumor",
        "short": "You're going to have to share some gossip of your own, but John seems to be in everyone's business",
        "meta": "This option will not consume all gossip required",
        "visible_if": "$trader_john_known>=3",
        "unlock_if": "$trader_john_known>=4, $trader_john_affordance>=3, $gossip >= 35",
        "random": "{ $charm > 0 : $charm + $fellowship >= 70 [50] | $charm >= 70 [50] }",
        "pass_long": "You hint at the things you want to know, if only because of the specific gossip you {$gossip.source} is tangentially related to the same topic. John is sharp, and you can see how he runs through the implications in his mind.\n\n\"You know... This sounds much like a thing I heard the other day. Don't take it as fact though... And definitely don't tell this to anyone else, hm?\" he explains, before he begins sharing the _whats_, _whos_ and _hows_ he was shared just the other day.\n\nHis sly smile suggests he knows full well you were fishing for this, but he seems to enjoy the sport of it.",
        "fail_long": "You try to be innocuous, but as you broach the topic you want to pick John's thoughts on, he firmly shakes his head.\n\n\"Sorry {$player_first_name}, even if I _did_ know anything about that, I'm afraid that is not something I can share, you understand?\"\n\nHe knows, but you're not getting it.",
        "pass_redirect": "trader_john_convo",
        "fail_redirect": "trader_john_convo",
        "pass_quality_change": "$rumors[source:were shared in confidence by John the Trader]+={2~5}, $gossip -= {25 + {1 ~ 7}}, $trader_john_time--, $trader_john_affordance -= 2",
        "fail_quality_change": "$trader_john_time--, $trader_john_affordance--"
      },
      {
        "id": "trader_john_convo_listen",
        "name": "Listen to John sharing gossip",
        "meta": "As you get to know John better, the chance he will randomly share gossip with you will increase",
        "visible_if": "$trader_john_known>=3",
        "unlock_if": "$village_life <= {5 + $trader_john_affordance + $trader_john_known}"
      },
      {
        "id": "trader_john_convo_learnmore",
        "name": "Learn more about the Trader",
        "image_code": "trader_john_img",
        "short": "His name is John, and he's a trader... That's about as much as you know right now. Surely there's more to learn?",
        "visible_if": "$trader_john_known = 2",
        "random": "$fellowship >= 30 [40]",
        "pass_long": "You get caught in conversation with John... Which isn't difficult. As it turns out, he is not necessarily discreet... About his own life and that of others. In fact, he seems very, _very_ indiscreet about the latter. The blacksmith? The tavernkeep? The old woman who lives by the lake? It seems like John doesn't just know all of them, but every little detail about their lives.\n\nStop paying attention for but a moment, and you might have just missed the juiciest morsel on a costermonger called Larkin who visited the town but a week ago. Your attention almost lapsed, but you caught yourself, and was able to respond to John's \"Strange, right?\". Nothing about it was strange, come to think of it, but the man has a knack for presenting it as such.\n\nDespite all the rumours and gossip you have just been made privy to, you realise one thing. John has managed to avoid, evade and deflect any questions about himself. Anything beyond surface level, at any rate. Is that intentional? The man might be shrewder than you initially thought.",
        "fail_long": "Though you try your conversational skills at the man, John maintains an inscrutible smile and keeps finding ways to share vaguely related anecdotes to whatever you're trying to learn. You're not sure if he's intentional, or whether he's reflexively redirecting your questions.\n\nBy the end of it, you find you have actually shared more about yourself than you care to admit. In fact, you're quite sure John was the one talking most of the time... Huh.",
        "pass_redirect": "trader_john_convo",
        "fail_redirect": "trader_john_convo",
        "pass_quality_change": "$trader_john_known=3, $gossip += 5",
        "fail_quality_change": "$gossip += 2, $awkward_memory++"
      }
    ]
  },
  "trader_john_wares": {
    "name": "A vast assortment of odds and ends",
    "image_code": "store",
    "text": "{$trader_john_known>=2: John's | The trader's } store is filled with crates, barrels, sacks and goods strewn around and about. Though it might look like a mess, there seems to be some organisation to it.",
    "metatext": "This store is not as easily navigable as others. The owner has a great number of items available, some more valuable than others, but you will have to make some effort to get to them. Getting to know the owner can help in this.",
    "return": "trader_john_entry",
    "options": [
      {
        "id": "trader_john_wares_rummage",
        "name": "Rummage through the frontmost goods",
        "image_code": "store",
        "visible_if": "$john_store_contents < 20 && $john_store_contents > 5",
        "random": "$scholar + $fellowship >= 40",
        "pass_long": "You mentally walk through the apparent system present in the store and ask a few questions if you can't quite figure it out. You get a sense of the rudimentary layout. Common trade goods sit next to second hand weapons and armaments, sit next to common tools. \n\nSmall sacks with imported spices sit on their own little shelf, and there's alchemical components, tinctures and potions all tucked in their own little corner.",
        "fail_long": "You walk through the store, and just as you turn to look at {$trader_john_known>=2: John | the trader }, you bump your head against a yute sack suspended by a crane. What a terrible mess.",
        "pass_redirect": "trader_john_wares",
        "fail_redirect": "trader_john_wares",
        "pass_quality_change": "$john_store_contents = {5 ~ 35}",
        "fail_quality_change": "$john_store_contents = {0 ~ 25}, $wounds++"
      },
      {
        "id": "trader_john_wares_avoid",
        "name": "Avoid unfortunately placed items",
        "image_code": "crate",
        "short": "Huh, what's that? ...Think fast!",
        "random": "$mettle >= 20 [30]",
        "pass_quality_change": "$john_store_contents = {6 ~ 15}",
        "fail_quality_change": "$john_store_contents = {0 ~ 10}, $painful_wound++"
      }
    ]
  }
}